Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f407v(g)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "at32_iomap.h"
#include "at32f403a_407-iomap.h"

/* ADC1_IN0 */
#define ADC1_IN0_PA0        AT32_PIN_MUX('A', 0, ANALOG, NORMP)

/* ADC1_IN1 */
#define ADC1_IN1_PA1        AT32_PIN_MUX('A', 1, ANALOG, NORMP)

/* ADC1_IN2 */
#define ADC1_IN2_PA2        AT32_PIN_MUX('A', 2, ANALOG, NORMP)

/* ADC1_IN3 */
#define ADC1_IN3_PA3        AT32_PIN_MUX('A', 3, ANALOG, NORMP)

/* ADC1_IN4 */
#define ADC1_IN4_PA4        AT32_PIN_MUX('A', 4, ANALOG, NORMP)

/* ADC1_IN5 */
#define ADC1_IN5_PA5        AT32_PIN_MUX('A', 5, ANALOG, NORMP)

/* ADC1_IN6 */
#define ADC1_IN6_PA6        AT32_PIN_MUX('A', 6, ANALOG, NORMP)

/* ADC1_IN7 */
#define ADC1_IN7_PA7        AT32_PIN_MUX('A', 7, ANALOG, NORMP)

/* ADC12_IN8 */
#define ADC1_IN8_PB0        AT32_PIN_MUX('B', 0, ANALOG, NORMP)

/* ADC1_IN9 */
#define ADC1_IN9_PB1        AT32_PIN_MUX('B', 1, ANALOG, NORMP)
	
/* ADC1_IN10 */
#define ADC1_IN10_PC0       AT32_PIN_MUX('C', 0, ANALOG, NORMP)
	
/* ADC1_IN11 */
#define ADC1_IN11_PC1       AT32_PIN_MUX('C', 1, ANALOG, NORMP)

/* ADC1_IN12 */
#define ADC1_IN12_PC2       AT32_PIN_MUX('C', 2, ANALOG, NORMP)

/* ADC1_IN13 */
#define ADC1_IN13_PC3       AT32_PIN_MUX('C', 3, ANALOG, NORMP)

/* ADC1_IN14 */
#define ADC1_IN14_PC4       AT32_PIN_MUX('C', 4, ANALOG, NORMP)

/* ADC1_IN15 */
#define ADC1_IN15_PC5       AT32_PIN_MUX('C', 5, ANALOG, NORMP)

/* ANALOG */
#define ANALOG_PA0          AT32_PIN_MUX('A', 0, ANALOG, NORMP)
#define ANALOG_PA1          AT32_PIN_MUX('A', 1, ANALOG, NORMP)
#define ANALOG_PA10         AT32_PIN_MUX('A', 10, ANALOG, NORMP)
#define ANALOG_PA11         AT32_PIN_MUX('A', 11, ANALOG, NORMP)
#define ANALOG_PA12         AT32_PIN_MUX('A', 12, ANALOG, NORMP)
#define ANALOG_PA13         AT32_PIN_MUX('A', 13, ANALOG, NORMP)
#define ANALOG_PA14         AT32_PIN_MUX('A', 14, ANALOG, NORMP)
#define ANALOG_PA15         AT32_PIN_MUX('A', 15, ANALOG, NORMP)
#define ANALOG_PA2          AT32_PIN_MUX('A', 2, ANALOG, NORMP)
#define ANALOG_PA3          AT32_PIN_MUX('A', 3, ANALOG, NORMP)
#define ANALOG_PA4          AT32_PIN_MUX('A', 4, ANALOG, NORMP)
#define ANALOG_PA5          AT32_PIN_MUX('A', 5, ANALOG, NORMP)
#define ANALOG_PA6          AT32_PIN_MUX('A', 6, ANALOG, NORMP)
#define ANALOG_PA7          AT32_PIN_MUX('A', 7, ANALOG, NORMP)
#define ANALOG_PA8          AT32_PIN_MUX('A', 8, ANALOG, NORMP)
#define ANALOG_PA9          AT32_PIN_MUX('A', 9, ANALOG, NORMP)
#define ANALOG_PB0          AT32_PIN_MUX('B', 0, ANALOG, NORMP)
#define ANALOG_PB1          AT32_PIN_MUX('B', 1, ANALOG, NORMP)
#define ANALOG_PB10         AT32_PIN_MUX('B', 10, ANALOG, NORMP)
#define ANALOG_PB11         AT32_PIN_MUX('B', 11, ANALOG, NORMP)
#define ANALOG_PB12         AT32_PIN_MUX('B', 12, ANALOG, NORMP)
#define ANALOG_PB13         AT32_PIN_MUX('B', 13, ANALOG, NORMP)
#define ANALOG_PB14         AT32_PIN_MUX('B', 14, ANALOG, NORMP)
#define ANALOG_PB15         AT32_PIN_MUX('B', 15, ANALOG, NORMP)
#define ANALOG_PB2          AT32_PIN_MUX('B', 2, ANALOG, NORMP)
#define ANALOG_PB3          AT32_PIN_MUX('B', 3, ANALOG, NORMP)
#define ANALOG_PB4          AT32_PIN_MUX('B', 4, ANALOG, NORMP)
#define ANALOG_PB5          AT32_PIN_MUX('B', 5, ANALOG, NORMP)
#define ANALOG_PB6          AT32_PIN_MUX('B', 6, ANALOG, NORMP)
#define ANALOG_PB7          AT32_PIN_MUX('B', 7, ANALOG, NORMP)
#define ANALOG_PB8          AT32_PIN_MUX('B', 8, ANALOG, NORMP)
#define ANALOG_PB9          AT32_PIN_MUX('B', 9, ANALOG, NORMP)	
#define ANALOG_PC0          AT32_PIN_MUX('C', 0, ANALOG, NORMP)
#define ANALOG_PC1          AT32_PIN_MUX('C', 1, ANALOG, NORMP)
#define ANALOG_PC10         AT32_PIN_MUX('C', 10, ANALOG, NORMP)
#define ANALOG_PC11         AT32_PIN_MUX('C', 11, ANALOG, NORMP)
#define ANALOG_PC12         AT32_PIN_MUX('C', 12, ANALOG, NORMP)
#define ANALOG_PC13         AT32_PIN_MUX('C', 13, ANALOG, NORMP)
#define ANALOG_PC14         AT32_PIN_MUX('C', 14, ANALOG, NORMP)
#define ANALOG_PC15         AT32_PIN_MUX('C', 15, ANALOG, NORMP)
#define ANALOG_PC2          AT32_PIN_MUX('C', 2, ANALOG, NORMP)
#define ANALOG_PC3          AT32_PIN_MUX('C', 3, ANALOG, NORMP)
#define ANALOG_PC4          AT32_PIN_MUX('C', 4, ANALOG, NORMP)
#define ANALOG_PC5          AT32_PIN_MUX('C', 5, ANALOG, NORMP)
#define ANALOG_PC6          AT32_PIN_MUX('C', 6, ANALOG, NORMP)
#define ANALOG_PC7          AT32_PIN_MUX('C', 7, ANALOG, NORMP)
#define ANALOG_PC8          AT32_PIN_MUX('C', 8, ANALOG, NORMP)
#define ANALOG_PC9          AT32_PIN_MUX('C', 9, ANALOG, NORMP)

#define ANALOG_PD0          AT32_PIN_MUX('D', 0, ANALOG, NORMP)
#define ANALOG_PD1          AT32_PIN_MUX('D', 1, ANALOG, NORMP)
#define ANALOG_PD10         AT32_PIN_MUX('D', 10, ANALOG, NORMP)
#define ANALOG_PD11         AT32_PIN_MUX('D', 11, ANALOG, NORMP)
#define ANALOG_PD12         AT32_PIN_MUX('D', 12, ANALOG, NORMP)
#define ANALOG_PD13         AT32_PIN_MUX('D', 13, ANALOG, NORMP)
#define ANALOG_PD14         AT32_PIN_MUX('D', 14, ANALOG, NORMP)
#define ANALOG_PD15         AT32_PIN_MUX('D', 15, ANALOG, NORMP)
#define ANALOG_PD2          AT32_PIN_MUX('D', 2, ANALOG, NORMP)
#define ANALOG_PD3          AT32_PIN_MUX('D', 3, ANALOG, NORMP)
#define ANALOG_PD4          AT32_PIN_MUX('D', 4, ANALOG, NORMP)
#define ANALOG_PD5          AT32_PIN_MUX('D', 5, ANALOG, NORMP)
#define ANALOG_PD6          AT32_PIN_MUX('D', 6, ANALOG, NORMP)
#define ANALOG_PD7          AT32_PIN_MUX('D', 7, ANALOG, NORMP)
#define ANALOG_PD8          AT32_PIN_MUX('D', 8, ANALOG, NORMP)
#define ANALOG_PD9          AT32_PIN_MUX('D', 9, ANALOG, NORMP)

#define ANALOG_PE0          AT32_PIN_MUX('E', 0, ANALOG, NORMP)
#define ANALOG_PE1          AT32_PIN_MUX('E', 1, ANALOG, NORMP)
#define ANALOG_PE10         AT32_PIN_MUX('E', 10, ANALOG, NORMP)
#define ANALOG_PE11         AT32_PIN_MUX('E', 11, ANALOG, NORMP)
#define ANALOG_PE12         AT32_PIN_MUX('E', 12, ANALOG, NORMP)
#define ANALOG_PE13         AT32_PIN_MUX('E', 13, ANALOG, NORMP)
#define ANALOG_PE14         AT32_PIN_MUX('E', 14, ANALOG, NORMP)
#define ANALOG_PE15         AT32_PIN_MUX('E', 15, ANALOG, NORMP)
#define ANALOG_PE2          AT32_PIN_MUX('E', 2, ANALOG, NORMP)
#define ANALOG_PE3          AT32_PIN_MUX('E', 3, ANALOG, NORMP)
#define ANALOG_PE4          AT32_PIN_MUX('E', 4, ANALOG, NORMP)
#define ANALOG_PE5          AT32_PIN_MUX('E', 5, ANALOG, NORMP)
#define ANALOG_PE6          AT32_PIN_MUX('E', 6, ANALOG, NORMP)
#define ANALOG_PE7          AT32_PIN_MUX('E', 7, ANALOG, NORMP)
#define ANALOG_PE8          AT32_PIN_MUX('E', 8, ANALOG, NORMP)
#define ANALOG_PE9          AT32_PIN_MUX('E', 9, ANALOG, NORMP)

