Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f407v(g)xx-pinctrl.h
/* CAN1 */
#define CAN1_RX_PA11        AT32_PIN_MUX('A', 11, GPIO_IN, CAN1_NORMP)
#define CAN1_TX_PA12        AT32_PIN_MUX('A', 12, ALTERNATE, CAN1_NORMP)

#define CAN1_RX_PB8         AT32_PIN_MUX('B', 8, GPIO_IN, CAN1_RMP2)
#define CAN1_TX_PB9         AT32_PIN_MUX('B', 9, ALTERNATE, CAN1_RMP2)

#define CAN1_RX_PD0         AT32_PIN_MUX('D', 0, GPIO_IN, CAN1_RMP3)
#define CAN1_TX_PD1         AT32_PIN_MUX('D', 1, ALTERNATE, CAN1_RMP3)

/* CAN2 */
#define CAN2_RX_PB12        AT32_PIN_MUX('B', 12, GPIO_IN, CAN2_NORMP)
#define CAN2_TX_PB13        AT32_PIN_MUX('B', 13, ALTERNATE, CAN2_NORMP)

#define CAN2_RX_PB5         AT32_PIN_MUX('B', 5, GPIO_IN, CAN2_RMP1)
#define CAN2_TX_PB6         AT32_PIN_MUX('B', 6, ALTERNATE, CAN2_RMP1)

/* USART1 */
#define USART1_CK_PA8       AT32_PIN_MUX('A', 8, ALTERNATE, NORMP)
#define USART1_CTS_PA11     AT32_PIN_MUX('A', 11, GPIO_IN, NORMP)
#define USART1_RTS_DE_PA12  AT32_PIN_MUX('A', 12, ALTERNATE, NORMP)

#define USART1_TX_PA9       AT32_PIN_MUX('A', 9, ALTERNATE, USART1_NORMP)
#define USART1_RX_PA10      AT32_PIN_MUX('A', 10, GPIO_IN, USART1_NORMP)

#define USART1_TX_PB6       AT32_PIN_MUX('B', 6, ALTERNATE, USART1_RMP1)
#define USART1_RX_PB7       AT32_PIN_MUX('B', 7, GPIO_IN, USART1_RMP1)

/* USART2 */
#define USART2_CK_PA4       AT32_PIN_MUX('A', 4, ALTERNATE, USART2_NORMP)
#define USART2_CTS_PA0      AT32_PIN_MUX('A', 0, GPIO_IN, USART2_NORMP)
#define USART2_RTS_DE_PA1   AT32_PIN_MUX('A', 1, ALTERNATE, USART2_NORMP)
#define USART2_TX_PA2       AT32_PIN_MUX('A', 2, ALTERNATE, USART2_NORMP)
#define USART2_RX_PA3       AT32_PIN_MUX('A', 3, GPIO_IN, USART2_NORMP)

#define USART2_CK_PD7       AT32_PIN_MUX('D', 7, ALTERNATE, USART2_RMP1)
#define USART2_CTS_PD3      AT32_PIN_MUX('D', 3, GPIO_IN, USART2_RMP1)
#define USART2_RTS_DE_PD4   AT32_PIN_MUX('D', 4, ALTERNATE, USART2_RMP1)
#define USART2_TX_PD5       AT32_PIN_MUX('D', 5, ALTERNATE, USART2_RMP1)
#define USART2_RX_PD6       AT32_PIN_MUX('D', 6, GPIO_IN, USART2_RMP1)

/* USART3 */
#define USART3_CK_PB12      AT32_PIN_MUX('B', 12, ALTERNATE, USART3_NORMP)
#define USART3_CTS_PB13     AT32_PIN_MUX('B', 13, GPIO_IN, NORMP)
#define USART3_RTS_DE_PB14  AT32_PIN_MUX('B', 14, ALTERNATE, NORMP)
#define USART3_TX_PB10      AT32_PIN_MUX('B', 10, ALTERNATE, USART3_NORMP)
#define USART3_RX_PB11      AT32_PIN_MUX('B', 11, GPIO_IN, USART3_NORMP)

#define USART3_CK_PC12      AT32_PIN_MUX('C', 12, ALTERNATE, USART3_RMP1)
#define USART3_TX_PC10      AT32_PIN_MUX('C', 10, ALTERNATE, USART3_RMP1)
#define USART3_RX_PC11      AT32_PIN_MUX('C', 11, GPIO_IN, USART3_RMP1)

#define USART3_CK_PD10      AT32_PIN_MUX('D', 10, ALTERNATE, USART3_RMP3)
#define USART3_CTS_PD11     AT32_PIN_MUX('D', 11, GPIO_IN, USART3_RMP3)
#define USART3_RTS_DE_PD12  AT32_PIN_MUX('D', 12, ALTERNATE, USART3_RMP3)
#define USART3_TX_PD8       AT32_PIN_MUX('D', 8, ALTERNATE, USART3_RMP3)
#define USART3_RX_PD9       AT32_PIN_MUX('D', 9, GPIO_IN, USART3_RMP3)

/* USART4 */
#define UART4_TX_PC10       AT32_PIN_MUX('C', 10, ALTERNATE, UART4_NORMP)
#define UART4_RX_PC11       AT32_PIN_MUX('C', 11, GPIO_IN, UART4_NORMP)

#define UART4_TX_PA0        AT32_PIN_MUX('A', 0, ALTERNATE, UART4_RMP2)
#define UART4_RX_PA1        AT32_PIN_MUX('A', 1, GPIO_IN, UART4_RMP2)

/* UART5 */
#define UART5_TX_PC12       AT32_PIN_MUX('C', 12, ALTERNATE, UART5_NORMP)
#define UART5_RX_PD2        AT32_PIN_MUX('D', 2, GPIO_IN, UART5_NORMP)

#define UART5_TX_PB9        AT32_PIN_MUX('B', 9, ALTERNATE, UART5_RMP1)
#define UART5_RX_PB8        AT32_PIN_MUX('B', 8, GPIO_IN, UART5_RMP1)

/* UART6 */
#define UART6_TX_PC6        AT32_PIN_MUX('C', 6, ALTERNATE, UART6_NORMP)
#define UART6_RX_PC7        AT32_PIN_MUX('C', 7, GPIO_IN, UART6_NORMP)

#define UART6_TX_PA4        AT32_PIN_MUX('A', 4, ALTERNATE, UART6_RMP1)
#define UART6_RX_PA5        AT32_PIN_MUX('A', 5, GPIO_IN, UART6_RMP1)

/* UART7 */
#define UART7_TX_PE8        AT32_PIN_MUX('E', 8, ALTERNATE, UART7_NORMP)
#define UART7_RX_PE7        AT32_PIN_MUX('E', 7, GPIO_IN, UART7_NORMP)

#define UART7_TX_PB4        AT32_PIN_MUX('B', 4, ALTERNATE, UART7_RMP1)
#define UART7_RX_PB3        AT32_PIN_MUX('B', 3, GPIO_IN, UART7_RMP1)

/* UART8 */
#define UART8_TX_PE1        AT32_PIN_MUX('E', 1, ALTERNATE, UART8_NORMP)
#define UART8_RX_PE0        AT32_PIN_MUX('E', 0, GPIO_IN, UART8_NORMP)

#define UART8_TX_PC2        AT32_PIN_MUX('C', 2, ALTERNATE, UART8_RMP1)
#define UART8_RX_PC3        AT32_PIN_MUX('C', 3, GPIO_IN, UART8_RMP1)

/* SPI1 */
#define SPI1_CS_PA4_MASTER_NORMP  AT32_PIN_MUX('A', 4, ALTERNATE, SPI1_NORMP)
#define SPI1_CS_PA4_SLAVE_NORMP   AT32_PIN_MUX('A', 4, GPIO_IN, SPI1_NORMP)
#define SPI1_SCK_PA5_MASTER_NORMP AT32_PIN_MUX('A', 5, ALTERNATE, SPI1_NORMP)
#define SPI1_SCK_PA5_SLAVE_NORMP  AT32_PIN_MUX('A', 5, GPIO_IN, SPI1_NORMP)
#define SPI1_MISO_PA6_MASTER_NORMP AT32_PIN_MUX('A', 6, GPIO_IN, SPI1_NORMP)
#define SPI1_MISO_PA6_SLAVE_NORMP  AT32_PIN_MUX('A', 6, ALTERNATE, SPI1_NORMP)
#define SPI1_MOSI_PA7_MASTER_NORMP AT32_PIN_MUX('A', 7, ALTERNATE, SPI1_NORMP)
#define SPI1_MOSI_PA7_SLAVE_NORMP  AT32_PIN_MUX('A', 7, GPIO_IN, SPI1_NORMP)
#define SPI1_MCK_PB0_MASTER_NORMP  AT32_PIN_MUX('B', 0, ALTERNATE, SPI1_NORMP)
#define SPI1_MCK_PB0_SLAVE_NORMP   AT32_PIN_MUX('B', 0, GPIO_IN, SPI1_NORMP)

#define SPI1_CS_PA15_MASTER_RMP1  AT32_PIN_MUX('A', 15, ALTERNATE, SPI1_RMP1)
#define SPI1_CS_PA15_SLAVE_RMP1   AT32_PIN_MUX('A', 15, GPIO_IN, SPI1_RMP1)
#define SPI1_SCK_PB3_MASTER_RMP1 AT32_PIN_MUX('B', 3, ALTERNATE, SPI1_RMP1)
#define SPI1_SCK_PB3_SLAVE_RMP1  AT32_PIN_MUX('B', 3, GPIO_IN, SPI1_RMP1)
#define SPI1_MISO_PB4_MASTER_RMP1 AT32_PIN_MUX('B', 4, GPIO_IN, SPI1_RMP1)
#define SPI1_MISO_PB4_SLAVE_RMP1  AT32_PIN_MUX('B', 4, ALTERNATE, SPI1_RMP1)
#define SPI1_MOSI_PB5_MASTER_RMP1 AT32_PIN_MUX('B', 5, ALTERNATE, SPI1_RMP1)
#define SPI1_MOSI_PB5_SLAVE_RMP1  AT32_PIN_MUX('B', 5, GPIO_IN, SPI1_RMP1)
#define SPI1_MCK_PB0_MASTER_RMP1  AT32_PIN_MUX('B', 0, ALTERNATE, SPI1_RMP1)
#define SPI1_MCK_PB0_SLAVE_RMP1   AT32_PIN_MUX('B', 0, GPIO_IN, SPI1_RMP1)

#define SPI1_CS_PA4_MASTER_RMP2  AT32_PIN_MUX('A', 4, ALTERNATE, SPI1_RMP2)
#define SPI1_CS_PA4_SLAVE_RMP2   AT32_PIN_MUX('A', 4, GPIO_IN, SPI1_RMP2)
#define SPI1_SCK_PA5_MASTER_RMP2 AT32_PIN_MUX('A', 5, ALTERNATE, SPI1_RMP2)
#define SPI1_SCK_PA5_SLAVE_RMP2  AT32_PIN_MUX('A', 5, GPIO_IN, SPI1_RMP2)
#define SPI1_MISO_PA6_MASTER_RMP2 AT32_PIN_MUX('A', 6, GPIO_IN, SPI1_RMP2)
#define SPI1_MISO_PA6_SLAVE_RMP2  AT32_PIN_MUX('A', 6, ALTERNATE, SPI1_RMP2)
#define SPI1_MOSI_PA7_MASTER_RMP2 AT32_PIN_MUX('A', 7, ALTERNATE, SPI1_RMP2)
#define SPI1_MOSI_PA7_SLAVE_RMP2  AT32_PIN_MUX('A', 7, GPIO_IN, SPI1_RMP2)
#define SPI1_MCK_PB6_MASTER_RMP2  AT32_PIN_MUX('B', 6, ALTERNATE, SPI1_RMP2)
#define SPI1_MCK_PB6_SLAVE_RMP2   AT32_PIN_MUX('B', 6, GPIO_IN, SPI1_RMP2)

#define SPI1_CS_PA15_MASTER_RMP3  AT32_PIN_MUX('A', 15, ALTERNATE, SPI1_RMP3)
#define SPI1_CS_PA15_SLAVE_RMP3   AT32_PIN_MUX('A', 15, GPIO_IN, SPI1_RMP3)
#define SPI1_SCK_PB3_MASTER_RMP3 AT32_PIN_MUX('B', 3, ALTERNATE, SPI1_RMP3)
#define SPI1_SCK_PB3_SLAVE_RMP3  AT32_PIN_MUX('B', 3, GPIO_IN, SPI1_RMP3)
#define SPI1_MISO_PB4_MASTER_RMP3 AT32_PIN_MUX('B', 4, GPIO_IN, SPI1_RMP3)
#define SPI1_MISO_PB4_SLAVE_RMP3  AT32_PIN_MUX('B', 4, ALTERNATE, SPI1_RMP3)
#define SPI1_MOSI_PB5_MASTER_RMP3 AT32_PIN_MUX('B', 5, ALTERNATE, SPI1_RMP3)
#define SPI1_MOSI_PB5_SLAVE_RMP3  AT32_PIN_MUX('B', 5, GPIO_IN, SPI1_RMP3)
#define SPI1_MCK_PB6_MASTER_RMP3  AT32_PIN_MUX('B', 6, ALTERNATE, SPI1_RMP3)
#define SPI1_MCK_PB6_SLAVE_RMP3   AT32_PIN_MUX('B', 6, GPIO_IN, SPI1_RMP3)

/* SPI2 */
#define SPI2_CS_PB12_MASTER_NORMP  AT32_PIN_MUX('B', 12, ALTERNATE, SPI2_NORMP)
#define SPI2_CS_PB12_SLAVE_NORMP   AT32_PIN_MUX('B', 12, GPIO_IN, SPI2_NORMP)
#define SPI2_SCK_PB13_MASTER_NORMP AT32_PIN_MUX('B', 13, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PB13_SLAVE_NORMP  AT32_PIN_MUX('B', 13, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB14_MASTER_NORMP AT32_PIN_MUX('B', 14, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB14_SLAVE_NORMP  AT32_PIN_MUX('B', 14, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PB15_MASTER_NORMP AT32_PIN_MUX('B', 15, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PB15_SLAVE_NORMP  AT32_PIN_MUX('B', 15, GPIO_IN, SPI2_NORMP)
#define SPI2_MCK_PC6_MASTER_NORMP  AT32_PIN_MUX('C', 6, ALTERNATE, SPI2_NORMP)
#define SPI2_MCK_PC6_SLAVE_NORMP   AT32_PIN_MUX('C', 6, GPIO_IN, SPI2_NORMP)

