Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f407v(g)xx-pinctrl.h
#define SPI2_CS_PB12_MASTER_RMP1  AT32_PIN_MUX('B', 12, ALTERNATE, SPI2_RMP1)
#define SPI2_CS_PB12_SLAVE_RMP1   AT32_PIN_MUX('B', 12, GPIO_IN, SPI2_RMP1)
#define SPI2_SCK_PB13_MASTER_RMP1 AT32_PIN_MUX('B', 13, ALTERNATE, SPI2_RMP1)
#define SPI2_SCK_PB13_SLAVE_RMP1  AT32_PIN_MUX('B', 13, GPIO_IN, SPI2_RMP1)
#define SPI2_MISO_PB14_MASTER_RMP1 AT32_PIN_MUX('B', 14, GPIO_IN, SPI2_RMP1)
#define SPI2_MISO_PB14_SLAVE_RMP1  AT32_PIN_MUX('B', 14, ALTERNATE, SPI2_RMP1)
#define SPI2_MOSI_PB15_MASTER_RMP1 AT32_PIN_MUX('B', 15, ALTERNATE, SPI2_RMP1)
#define SPI2_MOSI_PB15_SLAVE_RMP1  AT32_PIN_MUX('B', 15, GPIO_IN, SPI2_RMP1)
#define SPI2_MCK_PC6_MASTER_RMP1  AT32_PIN_MUX('A', 3, ALTERNATE, SPI2_RMP1)
#define SPI2_MCK_PC6_SLAVE_RMP1   AT32_PIN_MUX('A', 3, GPIO_IN, SPI2_RMP1)

#define SPI2_CS_PB12_MASTER_RMP2  AT32_PIN_MUX('B', 12, ALTERNATE, SPI2_RMP2)
#define SPI2_CS_PB12_SLAVE_RMP2   AT32_PIN_MUX('B', 12, GPIO_IN, SPI2_RMP2)
#define SPI2_SCK_PB13_MASTER_RMP2 AT32_PIN_MUX('B', 13, ALTERNATE, SPI2_RMP2)
#define SPI2_SCK_PB13_SLAVE_RMP2  AT32_PIN_MUX('B', 13, GPIO_IN, SPI2_RMP2)
#define SPI2_MISO_PB14_MASTER_RMP2 AT32_PIN_MUX('B', 14, GPIO_IN, SPI2_RMP2)
#define SPI2_MISO_PB14_SLAVE_RMP2  AT32_PIN_MUX('B', 14, ALTERNATE, SPI2_RMP2)
#define SPI2_MOSI_PB15_MASTER_RMP2 AT32_PIN_MUX('B', 15, ALTERNATE, SPI2_RMP2)
#define SPI2_MOSI_PB15_SLAVE_RMP2  AT32_PIN_MUX('B', 15, GPIO_IN, SPI2_RMP2)
#define SPI2_MCK_PC6_MASTER_RMP2  AT32_PIN_MUX('A', 6, ALTERNATE, SPI2_RMP2)
#define SPI2_MCK_PC6_SLAVE_RMP2   AT32_PIN_MUX('A', 6, GPIO_IN, SPI2_RMP2)

/* SPI3 */
#define SPI3_CS_PA15_MASTER_NORMP  AT32_PIN_MUX('A', 15, ALTERNATE, SPI3_NORMP)
#define SPI3_CS_PA15_SLAVE_NORMP   AT32_PIN_MUX('A', 15, GPIO_IN, SPI3_NORMP)
#define SPI3_SCK_PB3_MASTER_NORMP AT32_PIN_MUX('B', 3, ALTERNATE, SPI3_NORMP)
#define SPI3_SCK_PB3_SLAVE_NORMP  AT32_PIN_MUX('B', 3, GPIO_IN, SPI3_NORMP)
#define SPI3_MISO_PB4_MASTER_NORMP AT32_PIN_MUX('B', 4, GPIO_IN, SPI3_NORMP)
#define SPI3_MISO_PB4_SLAVE_NORMP  AT32_PIN_MUX('B', 4, ALTERNATE, SPI3_NORMP)
#define SPI3_MOSI_PB5_MASTER_NORMP AT32_PIN_MUX('B', 5, ALTERNATE, SPI3_NORMP)
#define SPI3_MOSI_PB5_SLAVE_NORMP  AT32_PIN_MUX('B', 5, GPIO_IN, SPI3_NORMP)
#define SPI3_MCK_PC7_MASTER_NORMP  AT32_PIN_MUX('C', 7, ALTERNATE, SPI3_NORMP)
#define SPI3_MCK_PC7_SLAVE_NORMP   AT32_PIN_MUX('C', 7, GPIO_IN, SPI3_NORMP)

#define SPI3_CS_PA4_MASTER_RMP1  AT32_PIN_MUX('A', 4, ALTERNATE, SPI3_RMP1)
#define SPI3_CS_PA4_SLAVE_RMP1   AT32_PIN_MUX('A', 4, GPIO_IN, SPI3_RMP1)
#define SPI3_SCK_PC10_MASTER_RMP1 AT32_PIN_MUX('C', 10, ALTERNATE, SPI3_RMP1)
#define SPI3_SCK_PC10_SLAVE_RMP1  AT32_PIN_MUX('C', 10, GPIO_IN, SPI3_RMP1)
#define SPI3_MISO_PC11_MASTER_RMP1 AT32_PIN_MUX('C', 11, GPIO_IN, SPI3_RMP1)
#define SPI3_MISO_PC11_SLAVE_RMP1  AT32_PIN_MUX('C', 11, ALTERNATE, SPI3_RMP1)
#define SPI3_MOSI_PC12_MASTER_RMP1 AT32_PIN_MUX('C', 12, ALTERNATE, SPI3_RMP1)
#define SPI3_MOSI_PC12_SLAVE_RMP1  AT32_PIN_MUX('C', 12, GPIO_IN, SPI3_RMP1)
#define SPI3_MCK_PC7_MASTER_RMP1  AT32_PIN_MUX('C', 7, ALTERNATE, SPI3_RMP1)
#define SPI3_MCK_PC7_SLAVE_RMP1   AT32_PIN_MUX('C', 7, GPIO_IN, SPI3_RMP1)

#define SPI3_CS_PA15_MASTER_RMP2  AT32_PIN_MUX('A', 15, ALTERNATE, SPI3_RMP2)
#define SPI3_CS_PA15_SLAVE_RMP2   AT32_PIN_MUX('A', 15, GPIO_IN, SPI3_RMP2)
#define SPI3_SCK_PB3_MASTER_RMP2 AT32_PIN_MUX('B', 3, ALTERNATE, SPI3_RMP2)
#define SPI3_SCK_PB3_SLAVE_RMP2  AT32_PIN_MUX('B', 3, GPIO_IN, SPI3_RMP2)
#define SPI3_MISO_PB4_MASTER_RMP2 AT32_PIN_MUX('B', 4, GPIO_IN, SPI3_RMP2)
#define SPI3_MISO_PB4_SLAVE_RMP2  AT32_PIN_MUX('B', 4, ALTERNATE, SPI3_RMP2)
#define SPI3_MOSI_PB5_MASTER_RMP2 AT32_PIN_MUX('B', 5, ALTERNATE, SPI3_RMP2)
#define SPI3_MOSI_PB5_SLAVE_RMP2  AT32_PIN_MUX('B', 5, GPIO_IN, SPI3_RMP2)
#define SPI3_MCK_PB10_MASTER_RMP2  AT32_PIN_MUX('B', 10, ALTERNATE, SPI3_RMP2)
#define SPI3_MCK_PB10_SLAVE_RMP2   AT32_PIN_MUX('B', 10, GPIO_IN, SPI3_RMP2)

#define SPI3_CS_PA4_MASTER_RMP3  AT32_PIN_MUX('A', 4, ALTERNATE, SPI3_RMP3)
#define SPI3_CS_PA4_SLAVE_RMP3   AT32_PIN_MUX('A', 4, GPIO_IN, SPI3_RMP3)
#define SPI3_SCK_PC10_MASTER_RMP3 AT32_PIN_MUX('C', 10, ALTERNATE, SPI3_RMP3)
#define SPI3_SCK_PC10_SLAVE_RMP3  AT32_PIN_MUX('C', 10, GPIO_IN, SPI3_RMP3)
#define SPI3_MISO_PC11_MASTER_RMP3 AT32_PIN_MUX('C', 11, GPIO_IN, SPI3_RMP3)
#define SPI3_MISO_PC11_SLAVE_RMP3  AT32_PIN_MUX('C', 11, ALTERNATE, SPI3_RMP3)
#define SPI3_MOSI_PC12_MASTER_RMP3 AT32_PIN_MUX('C', 12, ALTERNATE, SPI3_RMP3)
#define SPI3_MOSI_PC12_SLAVE_RMP3  AT32_PIN_MUX('C', 12, GPIO_IN, SPI3_RMP3)
#define SPI3_MCK_PB10_MASTER_RMP3  AT32_PIN_MUX('B', 10, ALTERNATE, SPI3_RMP3)
#define SPI3_MCK_PB10_SLAVE_RMP3   AT32_PIN_MUX('B', 10, GPIO_IN, SPI3_RMP3)

/* SPI4 */
#define SPI4_CS_PE4_MASTER_NORMP  AT32_PIN_MUX('E', 4, ALTERNATE, SPI4_NORMP)
#define SPI4_CS_PE4_SLAVE_NORMP   AT32_PIN_MUX('E', 4, GPIO_IN, SPI4_NORMP)
#define SPI4_SCK_PE2_MASTER_NORMP AT32_PIN_MUX('E', 2, ALTERNATE, SPI4_NORMP)
#define SPI4_SCK_PE2_SLAVE_NORMP  AT32_PIN_MUX('E', 2, GPIO_IN, SPI4_NORMP)
#define SPI4_MISO_PE5_MASTER_NORMP AT32_PIN_MUX('E', 5, GPIO_IN, SPI4_NORMP)
#define SPI4_MISO_PE5_SLAVE_NORMP  AT32_PIN_MUX('E', 5, ALTERNATE, SPI4_NORMP)
#define SPI4_MOSI_PE6_MASTER_NORMP AT32_PIN_MUX('E', 6, ALTERNATE, SPI4_NORMP)
#define SPI4_MOSI_PE6_SLAVE_NORMP  AT32_PIN_MUX('E', 6, GPIO_IN, SPI4_NORMP)
#define SPI4_MCK_PC8_MASTER_NORMP  AT32_PIN_MUX('C', 8, ALTERNATE, SPI4_NORMP)
#define SPI4_MCK_PC8_SLAVE_NORMP   AT32_PIN_MUX('C', 8, GPIO_IN, SPI4_NORMP)

#define SPI4_CS_PE12_MASTER_RMP1  AT32_PIN_MUX('E', 12, ALTERNATE, SPI4_RMP1)
#define SPI4_CS_PE12_SLAVE_RMP1   AT32_PIN_MUX('E', 12, GPIO_IN, SPI4_RMP1)
#define SPI4_SCK_PE11_MASTER_RMP1 AT32_PIN_MUX('E', 11, ALTERNATE, SPI4_RMP1)
#define SPI4_SCK_PE11_SLAVE_RMP1  AT32_PIN_MUX('E', 11, GPIO_IN, SPI4_RMP1)
#define SPI4_MISO_PE13_MASTER_RMP1 AT32_PIN_MUX('E', 13, GPIO_IN, SPI4_RMP1)
#define SPI4_MISO_PE13_SLAVE_RMP1  AT32_PIN_MUX('E', 13, ALTERNATE, SPI4_RMP1)
#define SPI4_MOSI_PE14_MASTER_RMP1 AT32_PIN_MUX('E', 14, ALTERNATE, SPI4_RMP1)
#define SPI4_MOSI_PE14_SLAVE_RMP1  AT32_PIN_MUX('E', 14, GPIO_IN, SPI4_RMP1)
#define SPI4_MCK_PC8_MASTER_RMP1  AT32_PIN_MUX('C', 8, ALTERNATE, SPI4_RMP1)
#define SPI4_MCK_PC8_SLAVE_RMP1   AT32_PIN_MUX('C', 8, GPIO_IN, SPI4_RMP1)

