Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f407v(g)xx-pinctrl.h
#define SPI4_CS_PB6_MASTER_RMP2  AT32_PIN_MUX('B', 6, ALTERNATE, SPI4_RMP2)
#define SPI4_CS_PB6_SLAVE_RMP2   AT32_PIN_MUX('B', 6, GPIO_IN, SPI4_RMP2)
#define SPI4_SCK_PB7_MASTER_RMP2 AT32_PIN_MUX('B', 7, ALTERNATE, SPI4_RMP2)
#define SPI4_SCK_PB7_SLAVE_RMP2  AT32_PIN_MUX('B', 7, GPIO_IN, SPI4_RMP2)
#define SPI4_MISO_PB8_MASTER_RMP2 AT32_PIN_MUX('B', 8, GPIO_IN, SPI4_RMP2)
#define SPI4_MISO_PB8_SLAVE_RMP2  AT32_PIN_MUX('B', 8, ALTERNATE, SPI4_RMP2)
#define SPI4_MOSI_PB9_MASTER_RMP2 AT32_PIN_MUX('B', 9, ALTERNATE, SPI4_RMP2)
#define SPI4_MOSI_PB9_SLAVE_RMP2  AT32_PIN_MUX('B', 9, GPIO_IN, SPI4_RMP2)
#define SPI4_MCK_PC8_MASTER_RMP2  AT32_PIN_MUX('C', 8, ALTERNATE, SPI4_RMP2)
#define SPI4_MCK_PC8_SLAVE_RMP2   AT32_PIN_MUX('C', 8, GPIO_IN, SPI4_RMP2)

#define SPI4_CS_PB6_MASTER_RMP3  AT32_PIN_MUX('B', 6, ALTERNATE, SPI4_RMP3)
#define SPI4_CS_PB6_SLAVE_RMP3   AT32_PIN_MUX('B', 6, GPIO_IN, SPI4_RMP3)
#define SPI4_SCK_PB7_MASTER_RMP3 AT32_PIN_MUX('B', 7, ALTERNATE, SPI4_RMP3)
#define SPI4_SCK_PB7_SLAVE_RMP3  AT32_PIN_MUX('B', 7, GPIO_IN, SPI4_RMP3)
#define SPI4_MISO_PB8_MASTER_RMP3 AT32_PIN_MUX('B', 8, GPIO_IN, SPI4_RMP3)
#define SPI4_MISO_PB8_SLAVE_RMP3  AT32_PIN_MUX('B', 8, ALTERNATE, SPI4_RMP3)
#define SPI4_MOSI_PB9_MASTER_RMP3 AT32_PIN_MUX('B', 9, ALTERNATE, SPI4_RMP3)
#define SPI4_MOSI_PB9_SLAVE_RMP3  AT32_PIN_MUX('B', 9, GPIO_IN, SPI4_RMP3)
#define SPI4_MCK_PA10_MASTER_RMP3  AT32_PIN_MUX('A', 10, ALTERNATE, SPI4_RMP3)
#define SPI4_MCK_PA10_SLAVE_RMP3   AT32_PIN_MUX('A', 10, GPIO_IN, SPI4_RMP3)

/* I2C1 */
#define I2C1_SCL_PB6_NORMP  AT32_PIN_MUX('B', 6, ALTERNATE, I2C1_NORMP)
#define I2C1_SDA_PB7_NORMP  AT32_PIN_MUX('B', 7, ALTERNATE, I2C1_NORMP)
#define I2C1_SMBA_PB5_NORMP  AT32_PIN_MUX('B',5, ALTERNATE, I2C1_NORMP)

#define I2C1_SCL_PB8_RMP1  AT32_PIN_MUX('B', 8, ALTERNATE, I2C1_RMP1)
#define I2C1_SDA_PB9_RMP1  AT32_PIN_MUX('B', 9, ALTERNATE, I2C1_RMP1)
#define I2C1_SMBA_PB5_RMP1  AT32_PIN_MUX('B',5, ALTERNATE, I2C1_RMP1)

/* I2C2 */
#define I2C2_SCL_PB10_NORMP  AT32_PIN_MUX('B', 10, ALTERNATE, I2C2_NORMP)
#define I2C2_SDA_PB11_NORMP  AT32_PIN_MUX('B', 11, ALTERNATE, I2C2_NORMP)
#define I2C2_SMBA_PB12_NORMP  AT32_PIN_MUX('B',12, ALTERNATE, I2C2_NORMP)

/* I2C3 */
#define I2C3_SCL_PA8_NORMP  AT32_PIN_MUX('A', 8, ALTERNATE, I2C3_NORMP)
#define I2C3_SDA_PC9_NORMP  AT32_PIN_MUX('C', 9, ALTERNATE, I2C3_NORMP)
#define I2C3_SMBA_PA9_NORMP  AT32_PIN_MUX('A',9, ALTERNATE, I2C3_NORMP)

#define I2C3_SCL_PA8_RMP1  AT32_PIN_MUX('A', 8, ALTERNATE, I2C3_RMP1)
#define I2C3_SDA_PB4_RMP1  AT32_PIN_MUX('B', 4, ALTERNATE, I2C3_RMP1)
#define I2C3_SMBA_PA9_RMP1  AT32_PIN_MUX('A',9, ALTERNATE, I2C3_RMP1)

/* TMR1 */
#define TMR1_EXT_PA12_NORMP  AT32_PIN_MUX('A', 12, GPIO_IN, TMR1_NORMP)
#define TMR1_CH1_PA8_OUTPUT_NORMP  AT32_PIN_MUX('A', 8, ALTERNATE, TMR1_NORMP)
#define TMR1_CH1_PA8_INPUT_NORMP  AT32_PIN_MUX('A', 8, GPIO_IN, TMR1_NORMP)
#define TMR1_CH2_PA9_OUTPUT_NORMP  AT32_PIN_MUX('A',9, ALTERNATE, TMR1_NORMP)
#define TMR1_CH2_PA9_INPUT_NORMP  AT32_PIN_MUX('A',9, GPIO_IN, TMR1_NORMP)
#define TMR1_CH3_PA10_OUTPUT_NORMP  AT32_PIN_MUX('A', 10, ALTERNATE, TMR1_NORMP)
#define TMR1_CH3_PA10_INPUT_NORMP  AT32_PIN_MUX('A', 10, GPIO_IN, TMR1_NORMP)
#define TMR1_CH4_PA11_OUTPUT_NORMP  AT32_PIN_MUX('A',11, ALTERNATE, TMR1_NORMP)
#define TMR1_CH4_PA11_INPUT_NORMP  AT32_PIN_MUX('A',11, GPIO_IN, TMR1_NORMP)
#define TMR1_BRK_PB12_NORMP  AT32_PIN_MUX('B',12, GPIO_IN, TMR1_NORMP)
#define TMR1_CH1C_PB13_OUTPUT_NORMP  AT32_PIN_MUX('B', 13, ALTERNATE, TMR1_NORMP)
#define TMR1_CH1C_PB13_INPUT_NORMP  AT32_PIN_MUX('B', 13, GPIO_IN, TMR1_NORMP)
#define TMR1_CH2C_PB13_OUTPUT_NORMP  AT32_PIN_MUX('B', 13, ALTERNATE, TMR1_NORMP)
#define TMR1_CH2C_PB13_INPUT_NORMP  AT32_PIN_MUX('B', 13, GPIO_IN, TMR1_NORMP)
#define TMR1_CH3C_PB14_OUTPUT_NORMP  AT32_PIN_MUX('B', 14, ALTERNATE, TMR1_NORMP)
#define TMR1_CH3C_PB14_INPUT_NORMP  AT32_PIN_MUX('B', 14, GPIO_IN, TMR1_NORMP)

#define TMR1_EXT_PA12_RMP1  AT32_PIN_MUX('A', 12, GPIO_IN, TMR1_RMP1)
#define TMR1_CH1_PA8_OUTPUT_RMP1  AT32_PIN_MUX('A', 8, ALTERNATE, TMR1_RMP1)
#define TMR1_CH1_PA8_INPUT_RMP1  AT32_PIN_MUX('A', 8, GPIO_IN, TMR1_RMP1)
#define TMR1_CH2_PA9_OUTPUT_RMP1  AT32_PIN_MUX('A',9, ALTERNATE, TMR1_RMP1)
#define TMR1_CH2_PA9_INPUT_RMP1  AT32_PIN_MUX('A',9, GPIO_IN, TMR1_RMP1)
#define TMR1_CH3_PA10_OUTPUT_RMP1  AT32_PIN_MUX('A', 10, ALTERNATE, TMR1_RMP1)
#define TMR1_CH3_PA10_INPUT_RMP1  AT32_PIN_MUX('A', 10, GPIO_IN, TMR1_RMP1)
#define TMR1_CH4_PA11_OUTPUT_RMP1  AT32_PIN_MUX('A',11, ALTERNATE, TMR1_RMP1)
#define TMR1_CH4_PA11_INPUT_RMP1  AT32_PIN_MUX('A',11, GPIO_IN, TMR1_RMP1)
#define TMR1_BRK_PA6_RMP1  AT32_PIN_MUX('A',6, GPIO_IN, TMR1_RMP1)
#define TMR1_CH1C_PA7_OUTPUT_RMP1  AT32_PIN_MUX('A', 7, ALTERNATE, TMR1_RMP1)
#define TMR1_CH1C_PA7_INPUT_RMP1  AT32_PIN_MUX('A', 7, GPIO_IN, TMR1_RMP1)
#define TMR1_CH2C_PB0_OUTPUT_RMP1  AT32_PIN_MUX('B', 0, ALTERNATE, TMR1_RMP1)
#define TMR1_CH2C_PB0_INPUT_RMP1  AT32_PIN_MUX('B', 0, GPIO_IN, TMR1_RMP1)
#define TMR1_CH3C_PB1_OUTPUT_RMP1  AT32_PIN_MUX('B', 1, ALTERNATE, TMR1_RMP1)
#define TMR1_CH3C_PB1_INPUT_RMP1  AT32_PIN_MUX('B', 1, GPIO_IN, TMR1_RMP1)

#define TMR1_EXT_PE7_RMP3  AT32_PIN_MUX('E', 7, GPIO_IN, TMR1_RMP3)
#define TMR1_CH1_PE9_OUTPUT_RMP3  AT32_PIN_MUX('E', 9, ALTERNATE, TMR1_RMP3)
#define TMR1_CH1_PE9_INPUT_RMP3  AT32_PIN_MUX('E', 9, GPIO_IN, TMR1_RMP3)
#define TMR1_CH2_PE11_OUTPUT_RMP3  AT32_PIN_MUX('E',11, ALTERNATE, TMR1_RMP3)
#define TMR1_CH2_PE11_INPUT_RMP3  AT32_PIN_MUX('E',11, GPIO_IN, TMR1_RMP3)
#define TMR1_CH3_PE13_OUTPUT_RMP3  AT32_PIN_MUX('E', 13, ALTERNATE, TMR1_RMP3)
#define TMR1_CH3_PE13_INPUT_RMP3  AT32_PIN_MUX('E', 13, GPIO_IN, TMR1_RMP3)
#define TMR1_CH4_PE14_OUTPUT_RMP3  AT32_PIN_MUX('E',14, ALTERNATE, TMR1_RMP3)
#define TMR1_CH4_PE14_INPUT_RMP3  AT32_PIN_MUX('E',14, GPIO_IN, TMR1_RMP3)
#define TMR1_BRK_PE15_RMP3  AT32_PIN_MUX('E',15, GPIO_IN, TMR1_RMP3)
#define TMR1_CH1C_PE8_OUTPUT_RMP3  AT32_PIN_MUX('E', 8, ALTERNATE, TMR1_RMP3)
#define TMR1_CH1C_PE8_INPUT_RMP3  AT32_PIN_MUX('E', 8, GPIO_IN, TMR1_RMP3)
#define TMR1_CH2C_PE10_OUTPUT_RMP3  AT32_PIN_MUX('E', 10, ALTERNATE, TMR1_RMP3)
#define TMR1_CH2C_PE10_INPUT_RMP3  AT32_PIN_MUX('E', 10, GPIO_IN, TMR1_RMP3)
#define TMR1_CH3C_PE12_OUTPUT_RMP3  AT32_PIN_MUX('E', 12, ALTERNATE, TMR1_RMP3)
#define TMR1_CH3C_PE12_INPUT_RMP3  AT32_PIN_MUX('E', 12, GPIO_IN, TMR1_RMP3)

/* TMR2 */
#define TMR2_CH1_PA0_OUTPUT_NORMP  AT32_PIN_MUX('A', 0, ALTERNATE, TMR2_NORMP)
#define TMR2_CH1_PA0_INPUT_NORMP  AT32_PIN_MUX('A', 0, GPIO_IN, TMR2_NORMP)
#define TMR2_CH2_PA1_OUTPUT_NORMP  AT32_PIN_MUX('A',1, ALTERNATE, TMR2_NORMP)
#define TMR2_CH2_PA1_INPUT_NORMP  AT32_PIN_MUX('A',1, GPIO_IN, TMR2_NORMP)
#define TMR2_CH3_PA2_OUTPUT_NORMP  AT32_PIN_MUX('A', 2, ALTERNATE, TMR2_NORMP)
#define TMR2_CH3_PA2_INPUT_NORMP  AT32_PIN_MUX('A', 2, GPIO_IN, TMR2_NORMP)
#define TMR2_CH4_PA3_OUTPUT_NORMP  AT32_PIN_MUX('A', 3, ALTERNATE, TMR2_NORMP)
#define TMR2_CH4_PA3_INPUT_NORMP  AT32_PIN_MUX('A',3, GPIO_IN, TMR2_NORMP)

#define TMR2_CH1_PA15_OUTPUT_RMP1  AT32_PIN_MUX('A', 15, ALTERNATE, TMR2_RMP1)
#define TMR2_CH1_PA15_INPUT_RMP1  AT32_PIN_MUX('A', 15, GPIO_IN, TMR2_RMP1)
#define TMR2_CH2_PB3_OUTPUT_RMP1  AT32_PIN_MUX('B',3, ALTERNATE, TMR2_RMP1)
#define TMR2_CH2_PB3_INPUT_RMP1  AT32_PIN_MUX('B',3, GPIO_IN, TMR2_RMP1)
#define TMR2_CH3_PA2_OUTPUT_RMP1  AT32_PIN_MUX('A', 2, ALTERNATE, TMR2_RMP1)
#define TMR2_CH3_PA2_INPUT_RMP1  AT32_PIN_MUX('A', 2, GPIO_IN, TMR2_RMP1)
#define TMR2_CH4_PA3_OUTPUT_RMP1  AT32_PIN_MUX('A', 3, ALTERNATE, TMR2_RMP1)
#define TMR2_CH4_PA3_INPUT_RMP1  AT32_PIN_MUX('A', 3, GPIO_IN, TMR2_RMP1)

#define TMR2_CH1_PA0_OUTPUT_RMP2  AT32_PIN_MUX('A', 0, ALTERNATE, TMR2_RMP2)
#define TMR2_CH1_PA0_INPUT_RMP2  AT32_PIN_MUX('A', 0, GPIO_IN, TMR2_RMP2)
#define TMR2_CH2_PA1_OUTPUT_RMP2  AT32_PIN_MUX('A',1, ALTERNATE, TMR2_RMP2)
#define TMR2_CH2_PA1_INPUT_RMP2  AT32_PIN_MUX('A',1, GPIO_IN, TMR2_RMP2)
#define TMR2_CH3_PB10_OUTPUT_RMP2  AT32_PIN_MUX('B', 10, ALTERNATE, TMR2_RMP2)
#define TMR2_CH3_PB10_INPUT_RMP2  AT32_PIN_MUX('B', 10, GPIO_IN, TMR2_RMP2)
#define TMR2_CH4_PB11_OUTPUT_RMP2  AT32_PIN_MUX('B', 11, ALTERNATE, TMR2_RMP2)
#define TMR2_CH4_PB11_INPUT_RMP2  AT32_PIN_MUX('B', 11, GPIO_IN, TMR2_RMP2)

#define TMR2_CH1_PA15_OUTPUT_RMP3  AT32_PIN_MUX('A', 15, ALTERNATE, TMR2_RMP3)
#define TMR2_CH1_PA15_INPUT_RMP3  AT32_PIN_MUX('A', 15, GPIO_IN, TMR2_RMP3)
#define TMR2_CH2_PB3_OUTPUT_RMP3  AT32_PIN_MUX('B',3, ALTERNATE, TMR2_RMP3)
#define TMR2_CH2_PB3_INPUT_RMP3  AT32_PIN_MUX('B',3, GPIO_IN, TMR2_RMP3)
#define TMR2_CH3_PB10_OUTPUT_RMP3  AT32_PIN_MUX('B', 10, ALTERNATE, TMR2_RMP3)
#define TMR2_CH3_PB10_INPUT_RMP3  AT32_PIN_MUX('B', 10, GPIO_IN, TMR2_RMP3)
#define TMR2_CH4_PB11_OUTPUT_RMP3  AT32_PIN_MUX('B', 11, ALTERNATE, TMR2_RMP3)
#define TMR2_CH4_PB11_INPUT_RMP3  AT32_PIN_MUX('B', 11, GPIO_IN, TMR2_RMP3)

/* TMR3 */
#define TMR3_CH1_PA6_OUTPUT_NORMP  AT32_PIN_MUX('A', 6, ALTERNATE, TMR3_NORMP)
#define TMR3_CH1_PA6_INPUT_NORMP  AT32_PIN_MUX('A', 6, GPIO_IN, TMR3_NORMP)
#define TMR3_CH2_PA7_OUTPUT_NORMP  AT32_PIN_MUX('A', 7, ALTERNATE, TMR3_NORMP)
#define TMR3_CH2_PA7_INPUT_NORMP  AT32_PIN_MUX('A', 7, GPIO_IN, TMR3_NORMP)
#define TMR3_CH3_PB0_OUTPUT_NORMP  AT32_PIN_MUX('B', 0, ALTERNATE, TMR3_NORMP)
#define TMR3_CH3_PB0_INPUT_NORMP  AT32_PIN_MUX('B', 0, GPIO_IN, TMR3_NORMP)
#define TMR3_CH4_PB1_OUTPUT_NORMP  AT32_PIN_MUX('B', 1, ALTERNATE, TMR3_NORMP)
#define TMR3_CH4_PB1_INPUT_NORMP  AT32_PIN_MUX('B', 1, GPIO_IN, TMR3_NORMP)

#define TMR3_CH1_PB4_OUTPUT_RMP2  AT32_PIN_MUX('B', 4, ALTERNATE, TMR3_RMP2)
#define TMR3_CH1_PB4_INPUT_RMP2  AT32_PIN_MUX('B', 4, GPIO_IN, TMR3_RMP2)
#define TMR3_CH2_PB5_OUTPUT_RMP2  AT32_PIN_MUX('B', 5, ALTERNATE, TMR3_RMP2)
#define TMR3_CH2_PB5_INPUT_RMP2  AT32_PIN_MUX('B', 5, GPIO_IN, TMR3_RMP2)
#define TMR3_CH3_PB0_OUTPUT_RMP2  AT32_PIN_MUX('B', 0, ALTERNATE, TMR3_RMP2)
#define TMR3_CH3_PB0_INPUT_RMP2  AT32_PIN_MUX('B', 0, GPIO_IN, TMR3_RMP2)
#define TMR3_CH4_PB1_OUTPUT_RMP2  AT32_PIN_MUX('B', 1, ALTERNATE, TMR3_RMP2)
#define TMR3_CH4_PB1_INPUT_RMP2  AT32_PIN_MUX('B', 1, GPIO_IN, TMR3_RMP2)

#define TMR3_CH1_PC6_OUTPUT_RMP3  AT32_PIN_MUX('C', 6, ALTERNATE, TMR3_RMP3)
#define TMR3_CH1_PC6_INPUT_RMP3  AT32_PIN_MUX('C', 6, GPIO_IN, TMR3_RMP3)
#define TMR3_CH2_PC7_OUTPUT_RMP3  AT32_PIN_MUX('C', 7, ALTERNATE, TMR3_RMP3)
#define TMR3_CH2_PC7_INPUT_RMP3  AT32_PIN_MUX('C', 7, GPIO_IN, TMR3_RMP3)
#define TMR3_CH3_PC8_OUTPUT_RMP3  AT32_PIN_MUX('C', 8, ALTERNATE, TMR3_RMP3)
#define TMR3_CH3_PC8_INPUT_RMP3  AT32_PIN_MUX('C', 8, GPIO_IN, TMR3_RMP3)
#define TMR3_CH4_PC9_OUTPUT_RMP3  AT32_PIN_MUX('C', 8, ALTERNATE, TMR3_RMP3)
#define TMR3_CH4_PC9_INPUT_RMP3  AT32_PIN_MUX('C', 9, GPIO_IN, TMR3_RMP3)

/* TMR4 */
#define TMR4_CH1_PB6_OUTPUT_NORMP  AT32_PIN_MUX('B', 6, ALTERNATE, TMR4_NORMP)
#define TMR4_CH1_PB6_INPUT_NORMP  AT32_PIN_MUX('B', 6, GPIO_IN, TMR4_NORMP)
#define TMR4_CH2_PB7_OUTPUT_NORMP  AT32_PIN_MUX('B', 7, ALTERNATE, TMR4_NORMP)
#define TMR4_CH2_PB7_INPUT_NORMP  AT32_PIN_MUX('B', 7, GPIO_IN, TMR4_NORMP)
#define TMR4_CH3_PB8_OUTPUT_NORMP  AT32_PIN_MUX('B', 8, ALTERNATE, TMR4_NORMP)
#define TMR4_CH3_PB9_INPUT_NORMP  AT32_PIN_MUX('B', 8, GPIO_IN, TMR4_NORMP)
#define TMR4_CH4_PB9_OUTPUT_NORMP  AT32_PIN_MUX('B', 9, ALTERNATE, TMR4_NORMP)
#define TMR4_CH4_PB9_INPUT_NORMP  AT32_PIN_MUX('B', 9, GPIO_IN, TMR4_NORMP)

#define TMR4_CH1_PD12_OUTPUT_RMP1  AT32_PIN_MUX('D', 12, ALTERNATE, TMR4_RMP1)
#define TMR4_CH1_PD12_INPUT_RMP1  AT32_PIN_MUX('D', 12, GPIO_IN, TMR4_RMP1)
#define TMR4_CH2_PD13_OUTPUT_RMP1  AT32_PIN_MUX('D', 13, ALTERNATE, TMR4_RMP1)
#define TMR4_CH2_PD13_INPUT_RMP1  AT32_PIN_MUX('D', 13, GPIO_IN, TMR4_RMP1)
#define TMR4_CH3_PD14_OUTPUT_RMP1  AT32_PIN_MUX('D', 14, ALTERNATE, TMR4_RMP1)
#define TMR4_CH3_PD14_INPUT_RMP1  AT32_PIN_MUX('D', 14, GPIO_IN, TMR4_RMP1)
#define TMR4_CH4_PD15_OUTPUT_RMP1  AT32_PIN_MUX('D', 15, ALTERNATE, TMR4_RMP1)
#define TMR4_CH4_PD15_INPUT_RMP1  AT32_PIN_MUX('D', 15, GPIO_IN, TMR4_RMP1)

/* TMR5 */
#define TMR5_CH1_PA0_OUTPUT_NORMP  AT32_PIN_MUX('A', 0, ALTERNATE, TMR5_NORMP)
#define TMR5_CH1_PA0_INPUT_NORMP  AT32_PIN_MUX('A', 0, GPIO_IN, TMR5_NORMP)
#define TMR5_CH2_PA1_OUTPUT_NORMP  AT32_PIN_MUX('A', 1, ALTERNATE, TMR5_NORMP)
#define TMR5_CH2_PA1_INPUT_NORMP  AT32_PIN_MUX('A', 1, GPIO_IN, TMR5_NORMP)
#define TMR5_CH3_PA2_OUTPUT_NORMP  AT32_PIN_MUX('A', 2, ALTERNATE, TMR5_NORMP)
#define TMR5_CH3_PA2_INPUT_NORMP  AT32_PIN_MUX('A', 2, GPIO_IN, TMR5_NORMP)
#define TMR5_CH4_PA3_OUTPUT_NORMP  AT32_PIN_MUX('A', 3, ALTERNATE, TMR5_NORMP)
#define TMR5_CH4_PA3_INPUT_NORMP  AT32_PIN_MUX('A', 3, GPIO_IN, TMR5_NORMP)

/* TMR8 */
#define TMR8_EXT_PA0_NORMP  AT32_PIN_MUX('A', 0, GPIO_IN, TMR8_NORMP)
#define TMR8_CH1_PC6_OUTPUT_NORMP  AT32_PIN_MUX('C', 6, ALTERNATE, TMR8_NORMP)
#define TMR8_CH1_PC6_INPUT_NORMP  AT32_PIN_MUX('C', 6, GPIO_IN, TMR8_NORMP)
#define TMR8_CH2_PC7_OUTPUT_NORMP  AT32_PIN_MUX('C',7, ALTERNATE, TMR8_NORMP)
#define TMR8_CH2_PC7_INPUT_NORMP  AT32_PIN_MUX('C',7, GPIO_IN, TMR8_NORMP)
#define TMR8_CH3_PC8_OUTPUT_NORMP  AT32_PIN_MUX('C', 8, ALTERNATE, TMR8_NORMP)
#define TMR8_CH3_PC8_INPUT_NORMP  AT32_PIN_MUX('C', 8, GPIO_IN, TMR8_NORMP)
#define TMR8_CH4_PC9_OUTPUT_NORMP  AT32_PIN_MUX('C',9, ALTERNATE, TMR8_NORMP)
#define TMR8_CH4_PC9_INPUT_NORMP  AT32_PIN_MUX('C',9, GPIO_IN, TMR8_NORMP)
#define TMR8_BRK_PA6_NORMP  AT32_PIN_MUX('A', 6, GPIO_IN, TMR8_NORMP)
#define TMR8_CH1C_PA7_OUTPUT_NORMP  AT32_PIN_MUX('A', 7, ALTERNATE, TMR8_NORMP)
#define TMR8_CH1C_PA7_INPUT_NORMP  AT32_PIN_MUX('A', 7, GPIO_IN, TMR8_NORMP)
#define TMR8_CH2C_PB0_OUTPUT_NORMP  AT32_PIN_MUX('B', 0, ALTERNATE, TMR8_NORMP)
#define TMR8_CH2C_PB0_INPUT_NORMP  AT32_PIN_MUX('B', 0, GPIO_IN, TMR8_NORMP)
#define TMR8_CH3C_PB1_OUTPUT_NORMP  AT32_PIN_MUX('B', 1, ALTERNATE, TMR8_NORMP)
#define TMR8_CH3C_PB1_INPUT_NORMP  AT32_PIN_MUX('B', 1, GPIO_IN, TMR8_NORMP)

/* TMR9 */
#define TMR9_CH1_PA2_OUTPUT_NORMP  AT32_PIN_MUX('A', 2, ALTERNATE, TMR9_NORMP)
#define TMR9_CH1_PA2_INPUT_NORMP  AT32_PIN_MUX('A', 2, GPIO_IN, TMR9_NORMP)
#define TMR9_CH2_PA3_OUTPUT_NORMP  AT32_PIN_MUX('A', 3, ALTERNATE, TMR9_NORMP)
#define TMR9_CH2_PA3_INPUT_NORMP  AT32_PIN_MUX('A', 3, GPIO_IN, TMR9_NORMP)

#define TMR9_CH1_PE5_OUTPUT_RMP1  AT32_PIN_MUX('E', 5, ALTERNATE, TMR9_RMP1)
#define TMR9_CH1_PE5_INPUT_RMP1  AT32_PIN_MUX('E', 5, GPIO_IN, TMR9_RMP1)
#define TMR9_CH2_PE6_OUTPUT_RMP1  AT32_PIN_MUX('E', 6, ALTERNATE, TMR9_RMP1)
#define TMR9_CH2_PE6_INPUT_RMP1  AT32_PIN_MUX('E', 6, GPIO_IN, TMR9_RMP1)

/* TMR10 */
#define TMR10_CH1_PB8_OUTPUT_NORMP  AT32_PIN_MUX('B', 8, ALTERNATE, TMR10_NORMP)
#define TMR10_CH1_PB8_INPUT_NORMP  AT32_PIN_MUX('B', 8, GPIO_IN, TMR10_NORMP)

/* TMR11 */
#define TMR11_CH1_PB9_OUTPUT_NORMP  AT32_PIN_MUX('B', 9, ALTERNATE, TMR11_NORMP)
#define TMR11_CH1_PB9_INPUT_NORMP  AT32_PIN_MUX('B', 9, GPIO_IN, TMR11_NORMP)

/* TMR12 */
#define TMR12_CH1_PB14_OUTPUT_NORMP  AT32_PIN_MUX('B', 14, ALTERNATE, TMR12_NORMP)
#define TMR12_CH1_PB14_INPUT_NORMP  AT32_PIN_MUX('B', 14, GPIO_IN, TMR12_NORMP)
#define TMR12_CH2_PB15_OUTPUT_NORMP  AT32_PIN_MUX('B', 15, ALTERNATE, TMR12_NORMP)
#define TMR12_CH2_PB15_INPUT_NORMP  AT32_PIN_MUX('B', 15, GPIO_IN, TMR12_NORMP)

/* TMR13 */
#define TMR13_CH1_PA8_OUTPUT_NORMP  AT32_PIN_MUX('A', 8, ALTERNATE, TMR13_NORMP)
#define TMR13_CH1_PA8_INPUT_NORMP  AT32_PIN_MUX('A', 8, GPIO_IN, TMR13_NORMP)

/* TMR14 */
#define TMR14_CH1_PA7_OUTPUT_NORMP  AT32_PIN_MUX('A', 7, ALTERNATE, TMR14_NORMP)
#define TMR14_CH1_PA7_INPUT_NORMP  AT32_PIN_MUX('A', 7, GPIO_IN, TMR14_NORMP)
